a=[-7,0,2,0,0,10;
    0,0,0,0,0,0;
    0,0,-3,0,0,1;
    0,0,0,5,0,0];
c=[3,3,8,5;
    4,4,2,1;
    1,2,7,9;
    0,6,5,4;
    1,3,2,4;
    9,1,0,1];
e=[1,-1,2;2,2,3];
q=[1,2;2,1;1,1];
u=[1,1,0,1,0;0,1,1,1,1;1,0,1,1,0];
r=[1,2,-1;0,-1,2];
y=[1,2,0;0,0,2;2,4,0];
t=[1,2,3;1,0,1;2,0,2;2,4,6];
bb=[1;0;0];


b=formula(q,bb,1);   %前两个是矩阵A和列向量，第三个为参数1，2。   1代表输出方程组通解，如果不相容就输出最小二乘解。 2代表输出特解，相容就是极小范数解，不相容就是极小最小二乘解
%变量需要手动去formula文件里面输入z变元的个数
%b=Aplus(u);
%b=Aljian(t,1);
%qq=floor(unifrnd(100,200,1000,1000));
%b=Amjian(qq,1);
%b=Arjian(t);

%b=Ajian(t);
